# PartType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DuctFittingAndAccessoryData..::..PartType Property
DuctFittingAndAccessoryData Class See Also
---
The part type of the duct fitting or duct accessory.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public PartType PartType { get; }
```

Visual Basic
---
```text
Public ReadOnly Property PartType As PartType
	Get
```

Visual C++
---
```text
public:
property PartType PartType {
	PartType get ();
}
```

# See Also
DuctFittingAndAccessoryData Class
Autodesk.Revit.DB.Mechanical Namespace